<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Стандартныя радкі праверкі
    |--------------------------------------------------------------------------
    |
    | Наступныя радкі змяшчаюць стандартныя паведамленні праверкі, якія
    | выкарыстоўвае клас валідатара. Некаторыя правілы маюць некалькі версій,
    | напрыклад правілы памеру. Можаце змяняць любое з гэтых паведамленняў.
    |
    */

    'accepted'             => 'Вы павінны прыняць :attribute.',
    'active_url'           => 'Поле :attribute — несапраўдны URL.',
    'after'                => 'Поле :attribute павінна быць датай пасля :date.',
    'after_or_equal'       => 'Поле :attribute павінна быць датай пасля або роўнай :date.',
    'alpha'                => 'Поле :attribute можа змяшчаць толькі літары.',
    'alpha_dash'           => 'Поле :attribute можа змяшчаць толькі літары, лічбы, дэфіс і ніжняе падкрэсліванне.',
    'alpha_num'            => 'Поле :attribute можа змяшчаць толькі літары і лічбы.',
    'array'                => 'Поле :attribute павінна быць масівам.',
    'before'               => 'Поле :attribute павінна быць датай да :date.',
    'before_or_equal'      => 'Поле :attribute павінна быць датай да або роўнай :date.',
    'between'              => [
        'numeric' => 'Поле :attribute павінна быць паміж :min і :max.',
        'file'    => 'Памер файла :attribute павінен быць паміж :min і :max КБ.',
        'string'  => 'Тэкст :attribute павінен змяшчаць ад :min да :max сімвалаў.',
        'array'   => 'Поле :attribute павінна змяшчаць ад :min да :max элементаў.',
    ],
    'boolean'              => 'Поле :attribute павінна быць лагічнага тыпу.',
    'confirmed'            => 'Поле :attribute не супадае з пацвярджэннем.',
    'date'                 => 'Поле :attribute не з\'яўляецца карэктнай датай.',
    'date_equals'          => 'Поле :attribute павінна быць датай, роўнай :date.',
    'date_format'          => 'Поле :attribute не адпавядае фармату :format.',
    'different'            => 'Палі :attribute і :other павінны адрознівацца.',
    'digits'               => 'Поле :attribute павінна змяшчаць :digits лічбаў.',
    'digits_between'       => 'Поле :attribute павінна змяшчаць ад :min да :max лічбаў.',
    'dimensions'           => 'Поле :attribute мае недапушчальныя памеры выявы.',
    'distinct'             => 'Поле :attribute змяшчае паўтаральнае значэнне.',
    'email'                => 'Увядзіце карэктны адрас электроннай пошты.',
    'ends_with'            => 'Поле :attribute павінна заканчвацца адным з наступных: :values.',
    'exists'               => 'Абранае значэнне для :attribute некарэктнае.',
    'file'                 => 'Поле :attribute павінна быць файлам.',
    'filled'               => 'Поле :attribute абавязковае для запаўнення.',
    'gt'                   => [
        'numeric' => 'Поле :attribute павінна быць большым за :value.',
        'file'    => 'Памер файла :attribute павінен быць большым за :value КБ.',
        'string'  => 'Тэкст :attribute павінен быць даўжэйшым за :value сімвалаў.',
        'array'   => 'Поле :attribute павінна змяшчаць больш за :value элементаў.',
    ],
    'gte'                  => [
        'numeric' => 'Поле :attribute павінна быць большым або роўным :value.',
        'file'    => 'Памер файла :attribute павінен быць большым або роўным :value КБ.',
        'string'  => 'Тэкст :attribute павінен быць не карацейшым за :value сімвалаў.',
        'array'   => 'Поле :attribute павінна змяшчаць :value элементаў або больш.',
    ],
    'image'                => 'Поле :attribute павінна быць выявай.',
    'in'                   => 'Абранае значэнне для :attribute некарэктнае.',
    'in_array'             => 'Поле :attribute не існуе ў :other.',
    'integer'              => 'Поле :attribute павінна быць цэлым лікам.',
    'ip'                   => 'Поле :attribute павінна быць сапраўдным IP-адрасам.',
    'ipv4'                 => 'Поле :attribute павінна быць сапраўдным IPv4-адрасам.',
    'ipv6'                 => 'Поле :attribute павінна быць сапраўдным IPv6-адрасам.',
    'json'                 => 'Поле :attribute павінна быць JSON-радком.',
    'lt'                   => [
        'numeric' => 'Поле :attribute павінна быць меншым за :value.',
        'file'    => 'Памер файла :attribute павінен быць меншым за :value КБ.',
        'string'  => 'Тэкст :attribute павінен быць карацейшым за :value сімвалаў.',
        'array'   => 'Поле :attribute павінна змяшчаць менш за :value элементаў.',
    ],
    'lte'                  => [
        'numeric' => 'Поле :attribute павінна быць меншым або роўным :value.',
        'file'    => 'Памер файла :attribute павінен быць меншым або роўным :value КБ.',
        'string'  => 'Тэкст :attribute павінен быць не даўжэйшым за :value сімвалаў.',
        'array'   => 'Поле :attribute не павінна змяшчаць больш за :value элементаў.',
    ],
    'max'                  => [
        'numeric' => 'Поле :attribute не павінна быць большым за :max.',
        'file'    => 'Памер файла :attribute не павінен перавышаць :max КБ.',
        'string'  => 'Тэкст :attribute не павінен быць даўжэйшым за :max сімвалаў.',
        'array'   => 'Поле :attribute не павінна змяшчаць больш за :max элементаў.',
    ],
    'mimes'                => 'Поле :attribute павінна быць файлам аднаго з наступных тыпаў: :values.',
    'mimetypes'            => 'Поле :attribute павінна быць файлам аднаго з наступных тыпаў: :values.',
    'min'                  => [
        'numeric' => 'Поле :attribute павінна быць не меншым за :min.',
        'file'    => 'Памер файла :attribute павінен быць не меншым за :min КБ.',
        'string'  => 'Тэкст :attribute павінен змяшчаць не менш за :min сімвалаў.',
        'array'   => 'Поле :attribute павінна змяшчаць не менш за :min элементаў.',
    ],
    'not_in'               => 'Абранае значэнне для :attribute некарэктнае.',
    'not_regex'            => 'Няправільны фармат поля :attribute.',
    'numeric'              => 'Поле :attribute павінна быць лікам.',
    'present'              => 'Поле :attribute павінна прысутнічаць.',
    'regex'                => 'Поле :attribute мае няправільны фармат.',
    'required'             => 'Поле :attribute абавязковае для запаўнення.',
    'required_if'          => 'Поле :attribute абавязковае, калі :other роўна :value.',
    'required_unless'      => 'Поле :attribute абавязковае, калі :other не знаходзіцца ў :values.',
    'required_with'        => 'Поле :attribute абавязковае, калі пазначана :values.',
    'required_with_all'    => 'Поле :attribute абавязковае, калі пазначаны :values.',
    'required_without'     => 'Поле :attribute абавязковае, калі не пазначана :values.',
    'required_without_all' => 'Поле :attribute абавязковае, калі не пазначана ніводнае з :values.',
    'same'                 => 'Значэнне поля :attribute павінна супадаць з :other.',
    'size'                 => [
        'numeric' => 'Поле :attribute павінна быць :size.',
        'file'    => 'Памер файла :attribute павінен быць :size КБ.',
        'string'  => 'Тэкст :attribute павінен змяшчаць :size сімвалаў.',
        'array'   => 'Поле :attribute павінна змяшчаць :size элементаў.',
    ],
    'starts_with'          => 'Поле :attribute павінна пачынацца з аднаго з наступных: :values.',
    'string'               => 'Поле :attribute павінна быць радком.',
    'timezone'             => 'Поле :attribute павінна быць карэктным часавым поясам.',
    'unique'               => 'Такое значэнне поля :attribute ужо існуе.',
    'uploaded'             => 'Не ўдалося загрузіць файл :attribute.',
    'url'                  => 'Поле :attribute мае няправільны фармат URL.',
    'uuid'                 => 'Поле :attribute павінна быць карэктным UUID.',

    /*
    |--------------------------------------------------------------------------
    | Наладжвальныя паведамленні
    |--------------------------------------------------------------------------
    |
    | Тут можна пазначыць уласныя паведамленні для атрыбутаў, выкарыстоўваючы
    | пагадненне "attribute.rule" для назвы радкоў.
    |
    */

    'custom' => [
        'email' => [
            'unique' => 'Такі адрас ужо выкарыстоўваецца.',
        ],
        'password' => [
            'min' => 'Пароль павінен змяшчаць мінімум :min сімвалаў.',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Назвы атрыбутаў
    |--------------------------------------------------------------------------
    |
    | Наступныя радкі замяняюць назвы палёў на больш чытэльныя.
    |
    */

    'attributes' => [
        'name' => 'імя',
        'email' => 'адрас электроннай пошты',
        'password' => 'пароль',
        'password_confirmation' => 'пацвярджэнне пароля',
    ],

];
