<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Content Security Policy
    |--------------------------------------------------------------------------
    |
    | Настройки CSP для защиты от XSS атак
    |
    */

    'enabled' => env('CSP_ENABLED', true),

    /*
    |--------------------------------------------------------------------------
    | Дополнительные политики
    |--------------------------------------------------------------------------
    |
    | Можно добавить кастомные CSP директивы
    |
    */
    'policies' => [
        // Пример: "worker-src 'self' blob:"
    ],

    /*
    |--------------------------------------------------------------------------
    | Report URI
    |--------------------------------------------------------------------------
    |
    | URL для отправки отчетов о нарушениях CSP
    |
    */
    'report_uri' => env('CSP_REPORT_URI', null),
];

